<a href="https://colab.research.google.com/github/binladen360/DevC/blob/master/Copy_of_Lab_1_Python_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![](https://i.imgur.com/0AUxkXt.png)

# Lab 1 - Basic Python & SQL Exercise

## Basic Python

Wikipedia has a list whose goals is to include "all notable programming languages in existence", that currently lists over **700 programming languages**.

So you can tell that no way a developer can master all of the programming languages. But a developer can quickly perceive a new one if needed. The reason is there are common elements that present in every programming language (the five elements we cover in the lecture is a good example). And beyond that, programming is basically not about the syntax or code. It's about how to solve the problem with a combination of the key elements like the loop, if-condition, variables, etc. It requires logical thinking, creativity and since your code can grow pretty quick, it should be well-organized as well.

With that in mind now you can tell the best learning strategy is
* Understand the key elements deeply
* Solve simple problems with simple combinations
* When you can build a solution inside your head right after looking at a simple problem, move on to the next level.
* Practice, practice, and practice

Have fun and always be learning!

### Find the biggest and smallest number

In [ ]:
# Write a function to find smallest and biggest number out of given 3 numbers.
# Use if-statement only to solve this.
# Example: a=4, b=18, c=2 -> return 2

import numpy as np

a = np.random.randint(100)
b = np.random.randint(100)
c = np.random.randint(100)
print(a, b, c)

def smallest(a, b, c):
  # Your code here
  if(a <= b) and (a <= c):
     smallest = a
  elif (b <= a) and (b <= c):
     smallest = b
  else:
     smallest = c
  return smallest

def largest(a, b, c):
  # Your code here
  if(a > b) and (a > c):
    largest = a
  elif (b > a) and (b > c):
    largest = b
  else:
    largest = c
  return largest


print('The smallest of the 3 numbers is: ', smallest(a, b, c))
print('The largest of the 3 numbers is: ', largest(a, b, c))

37 85 63
The smallest of the 3 numbers is:  37
The largest of the 3 numbers is:  85

### Sum of numbers between a and b

In [ ]:
# Given two integers a and b (a ≤ b). Print sum of all numbers from A to B inclusively.
# Use a for-loop to solve this.
# Example a = 1, b = 10 -> 1+2+3+4+5+6+7+8+9+10 = 55

a = np.random.randint(10)
b = a + np.random.randint(10)

s = 0

# Your code here
for i in range (a,b+1):
  s +=i
print(a, b)
print(s)

9 13
55

### List all odd numbers

In [ ]:
# For a given interger n, write a function that print all odd numbers that are less than or equal n.
# Use a while-loop to solve this.
# Example n=5 -> 1 3 5

n = np.random.randint(100)

print('n = ', n)

# Your code here
i = 1 
while i <= n: 
  if i % 2 != 0:
    print(i) 
  i += 1

n =  62
1
3
5
7
9
11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49
51
53
55
57
59
61

## Advance Python

### 1. 

Write a function that rotates a list by k elements. For example, [1, 2, 3, 4, 5, 6] rotated by two becomes [3, 4, 5, 6, 1, 2]. Try solving this without creating a copy of the list. How many swap or move operations do you need?
Example:

input: 
```
[1, 2, 3, 4, 5, 6, 7, 8]
k = 3
```
output: 
```
[4, 5, 6, 7, 8, 1, 2, 3]
```

In [ ]:
def rotate_by_k(nums):
  nums = [1, 2, 3, 4, 5, 6, 7, 8]
  first_part = nums[:k]
  second_part = nums[k:]
  return second_part + first_part

### 2.


Given a sorted list of integers, square the elements and give the output in sorted order.

For example, given [-9, -2, 0, 2, 3], return [0, 4, 4, 9, 81].

In [ ]:
# Your code here

def sortSquare(arr, n): 
    for i in range(n): 
        arr[i]= arr[i] * arr[i] 
    arr.sort() 
  

arr = [-9, -2, 0, 2, 3] 
n = len(arr) 
  
print("Before sort") 
for i in range(n): 
    print(arr[i], end = " ") 
  
print("\n") 
  
sortSquare(arr, n) 
  
print("After sort") 
for i in range(n): 
    print(arr[i], end = " ")

Before sort
-9 -2 0 2 3

After sort
0 4 4 9 81

### 3.
This problem was asked by Snapchat.

Given a list of possibly overlapping intervals, return a new list of intervals where all overlapping intervals have been merged.

The input list is not necessarily ordered in any way.

For example, given [(1, 3), (5, 8), (4, 10), (20, 25)], you should return [(1, 3), (4, 10), (20, 25)].

In [ ]:
# Your code here
def mergeIntervals(arr): 
          
        # Sorting based on the increasing order  
        # of the start intervals 
        arr.sort(key = lambda x: x[0])  
          
        # array to hold the merged intervals 
        m = [] 
        s = -10000
        max = -100000
        for i in range(len(arr)): 
            a = arr[i] 
            if a[0] > max: 
                if i != 0: 
                    m.append([s,max]) 
                max = a[1] 
                s = a[0] 
            else: 
                if a[1] >= max: 
                    max = a[1] 
          
        #'max' value gives the last point of  
        # that particular interval 
        # 's' gives the starting point of that interval 
        # 'm' array contains the list of all merged intervals 
  
        if max != -100000 and [s, max] not in m: 
            m.append([s, max]) 
        print("The Merged Intervals are :", end = " ") 
        for i in range(len(m)): 
            print(m[i], end = " ") 
  
# Driver code 
arr =  [(1, 3), (5, 8), (4, 10), (20, 25)]
mergeIntervals(arr)

The Merged Intervals are : [1, 3] [4, 10] [20, 25]

### 4.
Given a string, write a c function to check if it is palindrome or not. 
A string is said to be palindrome if reverse of the string is same as string. For example, “abba” is palindrome, but “abbc” is not palindrome.

In [ ]:
# Your code here
def isPalindrome(s):
    return s == s[::-1]
 
 
# Driver code
s = "abba"
ans = isPalindrome(s)
 
if ans:
    print("Yes")
else:
    print("No")

Yes

### 5.
You are given a string. The only operation allowed is to insert characters in the beginning of the string. How many minimum characters are needed to be inserted to make the string a palindrome string

Example:
Input: ABC
Output: 2
Input: AACECAAAA
Output: 2

In [ ]:
# Your code here
def ispalindrome(s): 
  
    l = len(s) 
      
    i = 0
    j = l - 1
    while i <= j: 
      
        if(s[i] != s[j]): 
            return False
        i += 1
        j -= 1
      
    return True
  
# Driver code 
if __name__ == "__main__": 
      
    s = "AACECAAAA"
    cnt = 0
    flag = 0
      
    while(len(s) > 0): 
      
        # if string becomes palindrome then break 
        if(ispalindrome(s)): 
            flag = 1
            break
          
        else: 
            cnt += 1
          
            # erase the last element of the string 
            s = s[:-1] 
      
    # print the number of insertion at front 
    if(flag): 
        print(cnt)

2

## Basic SQL

SQL, or Structured Query Language, is a language designed to allow both technical and non-technical users query, manipulate, and transform data from a **relational database**. And due to its simplicity, SQL databases provide safe and scalable storage for millions of websites and mobile applications.

A relational database represents a collection of related (two-dimensional) tables. Each of the tables are similar to an Excel spreadsheet, with a fixed number of named columns (the attributes or properties of the table) and any number of rows of data.

For example, if the Department of Motor Vehicles had a database, you might find a table containing all the known vehicles that people in the state are driving. This table might need to store the model name, type, number of wheels, and number of doors of each vehicle for example.

| Id | Make/Model | # Wheels | # Door | Type |
|:---:|:----------------------------:|:---------------:|:-----------:|:--------:|
| 1 | Ford Focus | 4 | 4 | Sedan |
| 2 | Tesla Roadster | 4 | 2 | Sports |
| 3 | Kawakasi Ninja | 2 | 0 | Motorcycle |
| 4 | McLaren Formula 1 | 4 | 0 | Race |
| 5 | Testla S | 4 | 4 | Sedan |

In such a database, you might find additional related tables containing information such as a list of all registered drivers in the state, the types of driving licenses that can be granted, or even driving violations for each driver.

By learning SQL, the goal is to learn how to answer specific questions about this data, like *"What types of vehicles are on the road have less than four wheels?"*, or *"How many models of cars does Tesla produce?"*, to help us make better decisions down the road.

### Connect to the database

![](https://i.imgur.com/kCaiMK5.png)

**Run those cells below**

In [ ]:
# Download database
!wget https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db

--2020-09-09 11:53:29--  https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db
Resolving ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com (ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com)... 52.219.128.75
Connecting to ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com (ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com)|52.219.128.75|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 884736 (864K) [binary/octet-stream]
Saving to: ‘chinook.db’

chinook.db          100%[===================>] 864.00K   908KB/s    in 1.0s

2020-09-09 11:53:31 (908 KB/s) - ‘chinook.db’ saved [884736/884736]

In [ ]:
import sqlite3
conn = sqlite3.connect('chinook.db')

In [ ]:
import pandas as pd
data = pd.read_sql_query('SELECT * FROM albums;', conn)
data.head() 
# head(n) is a function that show n first rows of the data, by default n=5

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

### Write your first query

Given a table of data, the most basic query we could write would be one that selects for a couple columns (properties) of the table with all the rows (instances).

```SQL
SELECT column, another_column, …
FROM mytable;
```
If we want to retrieve absolutely all the columns of data from a table, we can then use the asterisk (*) shorthand in place of listing all the column names individually.
```SQL
SELECT * 
FROM mytable;
```

In [ ]:
# Replace ___ with a query that list all the employees first name and last name
q = 'select LastName,FirstName from employees '
pd.read_sql_query(q, conn)

   LastName FirstName
0     Adams    Andrew
1   Edwards     Nancy
2   Peacock      Jane
3      Park  Margaret
4   Johnson     Steve
5  Mitchell   Michael
6      King    Robert
7  Callahan     Laura

In [ ]:
# Find the title of each employee
q = ' select Title from employees'
pd.read_sql_query(q, conn)

                 Title
0      General Manager
1        Sales Manager
2  Sales Support Agent
3  Sales Support Agent
4  Sales Support Agent
5           IT Manager
6             IT Staff
7             IT Staff

In [ ]:
# Find the name of each artist
# Print out how many artist are there in the database
q = 'select Name from artists'
pd.read_sql_query(q, conn)
print('There are 275 artists.')

There are 275 artists.

### Queries with contraints

In order to filter certain results, we need to use a **WHERE** clause in the query.
```
SELECT column, another_column, ...
FROM mytable
WHERE conditions
    AND/OR another_condition
    AND/OR ...;
```

Below are some useful operators that you can use for numerical data (ie. integer or floating point)

| Operator | Condition | SQL Example |
|:--------------:|:---------------:|:----------------------:|
| =, !=, < <=, >, >= | Standard numerical operators	| col_name != 4 |
| **BETWEEN** … **AND** …	| Number is within range of two values (inclusive) |	col_name **BETWEEN** 1.5 **AND** 10.5 |
| **NOT BETWEEN** … **AND** …	| Number is not within range of two values (inclusive) |	col_name **NOT BETWEEN** 1 **AND** 10 |
| **IN** (…)	| Number exists in a list	| col_name **IN** (2, 4, 6) |
| **NOT IN** (…) |	Number does not exist in a list |	col_name **NOT IN** (1, 3, 5) |

When writing WHERE clauses with columns containing text data, SQL supports a number of useful operators to do things like case-insensitive string comparison and wildcard pattern matching. Below is a few common text-data specific operators:

| Operator | Condition | SQL Example |
|:--------------:|:---------------:|:----------------------:|
| = |	Case sensitive exact string comparison (notice the single equals) |	col_name = "abc" |
| != or <>	| Case sensitive exact string inequality comparison	| col_name != "abcd" |
| **LIKE**	| Case insensitive exact string comparison	| col_name **LIKE** "ABC" |
| **NOT LIKE**	| Case insensitive exact string inequality comparison	| col_name **NOT LIKE** "ABCD" |
| %	| Used anywhere in a string to match a sequence of zero or more characters (only with **LIKE** or **NOT LIKE**)	| col_name **LIKE** "%AT%" (matches "AT", "ATTIC", "CAT" or even "BATS") |
| _	| Used anywhere in a string to match a single character (only with **LIKE** or **NOT LIKE**)	| col_name **LIKE** "AN_" (matches "AND", but not "AN") |
| **IN** (…) | String exists in a list	| col_name **IN** ("A", "B", "C") |
| **NOT IN** (…) | String does not exist in a list	| col_name **NOT IN** ("D", "E", "F") |

In [ ]:
pd.read_sql_query('SELECT * FROM invoices;',conn).head()

   InvoiceId  CustomerId  ... BillingPostalCode  Total
0          1           2  ...             70174   1.98
1          2           4  ...              0171   3.96
2          3           8  ...              1000   5.94
3          4          14  ...           T6G 2C7   8.91
4          5          23  ...              2113  13.86

[5 rows x 9 columns]

In [ ]:
# Find all $1 bill or lower
q = ' select * from invoices where Total <= 1'
pd.read_sql_query(q,conn)

    InvoiceId  CustomerId  ... BillingPostalCode Total
0           6          37  ...             60316  0.99
1          13          16  ...        94043-1351  0.99
2          20          54  ...           EH4 1HH  0.99
3          27          33  ...           X1A 1N6  0.99
4          34          12  ...         20040-020  0.99
5          41          50  ...             28015  0.99
6          48          29  ...           M6J 1V1  0.99
7          55           8  ...              1000  0.99
8          62          46  ...              None  0.99
9          69          25  ...             53703  0.99
10         76           4  ...              0171  0.99
11         83          42  ...             33000  0.99
12         90          21  ...             89503  0.99
13        104          38  ...             10779  0.99
14        111          17  ...        98052-8300  0.99
15        118          55  ...              2010  0.99
16        125          34  ...              None  0.99
17        132          13  ...         71020-677  0.99
18        139          51  ...             11230  0.99
19        146          30  ...           K2P 1L7  0.99
20        153           9  ...              1720  0.99
21        160          47  ...             00192  0.99
22        167          26  ...             76110  0.99
23        174           5  ...             14700  0.99
24        181          43  ...             21000  0.99
25        188          22  ...             32801  0.99
26        195           1  ...         12227-000  0.99
27        209          18  ...        10012-2612  0.99
28        216          56  ...              1106  0.99
29        223          35  ...              None  0.99
30        230          14  ...           T6G 2C7  0.99
31        237          52  ...            N1 5LH  0.99
32        244          31  ...           B3S 1C5  0.99
33        251          10  ...         01007-010  0.99
34        258          48  ...              1016  0.99
35        265          27  ...             85719  0.99
36        272           6  ...             14300  0.99
37        279          44  ...             00530  0.99
38        286          23  ...              2113  0.99
39        293           2  ...             70174  0.99
40        300          40  ...             75002  0.99
41        314          57  ...              None  0.99
42        321          36  ...             10789  0.99
43        328          15  ...           V6C 1G8  0.99
44        335          53  ...          SW1V 3EN  0.99
45        342          32  ...           R3L 2B9  0.99
46        349          11  ...         01310-200  0.99
47        356          49  ...            00-358  0.99
48        363          28  ...             84102  0.99
49        370           7  ...              1010  0.99
50        377          45  ...            H-1073  0.99
51        384          24  ...             60611  0.99
52        391           3  ...           H2G 1A7  0.99
53        398          41  ...             69002  0.99
54        405          20  ...         94040-111  0.99

[55 rows x 9 columns]

In [ ]:
# Find all invoice of customers who are in the USA or Canada
q = '''select * from invoices where (BillingCountry = 'USA') or (BillingCountry ='Canada')'''
pd.read_sql_query(q,conn)

     InvoiceId  CustomerId  ... BillingPostalCode  Total
0            4          14  ...           T6G 2C7   8.91
1            5          23  ...              2113  13.86
2           13          16  ...        94043-1351   0.99
3           14          17  ...        98052-8300   1.98
4           15          19  ...             95014   1.98
..         ...         ...  ...               ...    ...
142        405          20  ...         94040-111   0.99
143        406          21  ...             89503   1.98
144        407          23  ...              2113   1.98
145        408          25  ...             53703   3.96
146        409          29  ...           M6J 1V1   5.94

[147 rows x 9 columns]

In [ ]:
# Find all invoice in 2011
q='''
SELECT * FROM invoices
where InvoiceDate LIKE '2011%'

'''
pd.read_sql_query(q,conn)

    InvoiceId  CustomerId  ... BillingPostalCode Total
0         167          26  ...             76110  0.99
1         168          27  ...             85719  1.98
2         169          29  ...           M6J 1V1  1.98
3         170          31  ...           B3S 1C5  3.96
4         171          35  ...              None  5.94
..        ...         ...  ...               ...   ...
78        245          32  ...           R3L 2B9  1.98
79        246          34  ...              None  1.98
80        247          36  ...             10789  3.96
81        248          40  ...             75002  5.94
82        249          46  ...              None  8.91

[83 rows x 9 columns]

### Filtering and Sorting query results

SQL provides a convenient way to discard rows that have a duplicate column value by using the **DISTINCT** keyword:

```
SELECT DISTINCT column, another_column, …
FROM mytable
WHERE condition(s);
```

SQL provides a way to sort your results by a given column in ascending or descending order using the **ORDER BY** clause:

```
SELECT column, another_column, …
FROM mytable
WHERE condition(s)
ORDER BY column ASC/DESC;
```

Another clause which is commonly used with the **ORDER BY** clause are the **LIMIT** and **OFFSET** clauses, which are a useful optimization to indicate to the database the subset of the results you care about.
The **LIMIT** will reduce the number of rows to return, and the optional **OFFSET** will specify where to begin counting the number rows from.

```
SELECT column, another_column, …
FROM mytable
WHERE condition(s)
ORDER BY column ASC/DESC
LIMIT num_limit OFFSET num_offset;
```

In [ ]:
# Find a list of all countries where customers live in
q = 'select Country from customers'
pd.read_sql_query(q,conn)

           Country
0           Brazil
1          Germany
2           Canada
3           Norway
4   Czech Republic
5   Czech Republic
6          Austria
7          Belgium
8          Denmark
9           Brazil
10          Brazil
11          Brazil
12          Brazil
13          Canada
14          Canada
15             USA
16             USA
17             USA
18             USA
19             USA
20             USA
21             USA
22             USA
23             USA
24             USA
25             USA
26             USA
27             USA
28          Canada
29          Canada
30          Canada
31          Canada
32          Canada
33        Portugal
34        Portugal
35         Germany
36         Germany
37         Germany
38          France
39          France
40          France
41          France
42          France
43         Finland
44         Hungary
45         Ireland
46           Italy
47     Netherlands
48          Poland
49           Spain
50          Sweden
51  United Kingdom
52  United Kingdom
53  United Kingdom
54       Australia
55       Argentina
56           Chile
57           India
58           India

In [ ]:
# Find the top 5 cheapest bill
q = ''' select Total from invoices limit 5 offset 0'''
pd.read_sql_query(q,conn)

   Total
0   1.98
1   3.96
2   5.94
3   8.91
4  13.86

In [ ]:
# Find the last 5 invoice
q = ''' select Total from invoices limit 5 offset 82 '''
pd.read_sql_query(q,conn)

   Total
0   0.99
1   1.98
2   1.98
3   3.96
4   6.94

In [ ]:
# Find the next five invoice 
q = 'SELECT * FROM invoices ORDER BY InvoiceId DESC LIMIT 5 OFFSET 5'
q = 'select * from invoices order by InvoiceId DESC limit 5 offset 10'
pd.read_sql_query(q,conn)

   InvoiceId  CustomerId  ... BillingPostalCode Total
0        402          50  ...             28015  5.94
1        401          46  ...              None  3.96
2        400          44  ...             00530  1.98
3        399          42  ...             33000  1.98
4        398          41  ...             69002  0.99

[5 rows x 9 columns]

### Practice simple SELECT query

You've done a good job getting to this point! Let's practice writing query that use all keywords we've learned so far.

In [ ]:
q ='select * from invoices order by  InvoiceDate DESC limit 10 offset 15'
pd.read_sql_query(q, conn).head()

   InvoiceId  CustomerId  ... BillingPostalCode  Total
0        397          27  ...             85719  13.86
1        396          18  ...        10012-2612   8.91
2        395          12  ...         20040-020   5.94
3        394           8  ...              1000   3.96
4        392           4  ...              0171   1.98

[5 rows x 9 columns]

In [ ]:
# List all cities in Germany where the company has customers
q = ''' select CustomerId,BillingCity, BillingCountry from invoices where BillingCountry='Germany' '''
pd.read_sql_query(q, conn)

    CustomerId BillingCity BillingCountry
0            2   Stuttgart        Germany
1           37   Frankfurt        Germany
2           38      Berlin        Germany
3            2   Stuttgart        Germany
4           36      Berlin        Germany
5           38      Berlin        Germany
6           36      Berlin        Germany
7           38      Berlin        Germany
8            2   Stuttgart        Germany
9           36      Berlin        Germany
10          38      Berlin        Germany
11          37   Frankfurt        Germany
12          37   Frankfurt        Germany
13          37   Frankfurt        Germany
14           2   Stuttgart        Germany
15           2   Stuttgart        Germany
16          36      Berlin        Germany
17          38      Berlin        Germany
18          38      Berlin        Germany
19           2   Stuttgart        Germany
20          36      Berlin        Germany
21          36      Berlin        Germany
22          38      Berlin        Germany
23           2   Stuttgart        Germany
24          36      Berlin        Germany
25          37   Frankfurt        Germany
26          37   Frankfurt        Germany
27          37   Frankfurt        Germany

In [ ]:
# Order all customers in the USA by their first name
q = '''select FirstName, Country from customers where Country='USA' '''
pd.read_sql_query(q, conn)

   FirstName Country
0      Frank     USA
1       Jack     USA
2   Michelle     USA
3        Tim     USA
4        Dan     USA
5      Kathy     USA
6    Heather     USA
7       John     USA
8      Frank     USA
9     Victor     USA
10   Richard     USA
11   Patrick     USA
12     Julia     USA

In [ ]:
# List three most expensive bill in Boston, USA
q =''' select Total,BillingCity,BillingCountry from invoices where BillingCity = 'Boston' and BillingCountry='USA' order by Total desc limit 3 offset 0 '''
pd.read_sql_query(q, conn)

   Total BillingCity BillingCountry
0  13.86      Boston            USA
1   8.91      Boston            USA
2   5.94      Boston            USA

In [ ]:
# List the third and fourth most expensive bill in 2012
q= '''select Total,InvoiceDate from invoices where InvoiceDate like'2012%' order by Total limit 2 offset 3 '''
pd.read_sql_query(q, conn)

   Total          InvoiceDate
0   0.99  2012-04-11 00:00:00
1   0.99  2012-05-12 00:00:00

### Multi-table queries with JOINs

Up to now, we've been working with a single table, but entity data in the real world is often broken down into pieces and stored across multiple tables.

Tables that share information about a single entity need to have a **primary key** that identifies that entity **uniquely** across the database. One common primary key type is an auto-incrementing integer (because they are space efficient), but it can also be a string, hashed value, so long as it is unique.

Using the **JOIN** clause in a query, we can combine row data across two separate tables using this unique key. The first of the joins that we will introduce is the **INNER JOIN**.

The **INNER JOIN** is a process that matches rows from the first table and the second table which have the same key (as defined by the **ON** constraint) to create a result row with the combined columns from both tables.

```
SELECT column, another_table_column, …
FROM mytable
INNER JOIN another_table 
    ON mytable.id = another_table.id
WHERE condition(s)
ORDER BY column, … ASC/DESC
LIMIT num_limit OFFSET num_offset;
```

**Example:**

In [ ]:
# First five rows in table albums

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [ ]:
# First five row in table artists
pd.read_sql_query('SELECT * FROM artists LIMIT 5;', conn)

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

In [ ]:
# Find the albums of Aerosmith
pd.read_sql_query('''SELECT * FROM 
                     albums INNER JOIN artists ON albums.ArtistId = artists.ArtistId 
                     WHERE artists.name="Aerosmith";''', conn)

   AlbumId     Title  ArtistId  ArtistId       Name
0        5  Big Ones         3         3  Aerosmith

**Your turn**

In [ ]:
# List first 10 tracks and its album's title order by track's name
q = ''' select tracks.Name,albums.Title from tracks  inner join albums  on  tracks.AlbumId = albums.AlbumId
  order by tracks.Name  limit 10'''
pd.read_sql_query(q, conn)

                                                Name                                              Title
0                                               "40"                                                War
1                                                "?"                                     Lost, Season 2
2  "Eine Kleine Nachtmusik" Serenade In G, K. 525...                Sir Neville Marriner: A Celebration
3                                            #1 Zero                                       Out Of Exile
4                                           #9 Dream  Instant Karma: The Amnesty International Campa...
5                                    'Round Midnight                 The Essential Miles Davis [Disc 1]
6                         (Anesthesia) Pulling Teeth                                       Kill 'Em All
7                                      (Da Le) Yaleo                                       Supernatural
8            (I Can't Help) Falling In Love With You                 UB40 The Best Of - Volume Two [UK]
9                                  (Oh) Pretty Woman                                         Diver Down

In [ ]:
# List all employees and who they report to
q = ' select employees.FirstName, employees.Title, customers.FirstName, employees.Title   from employees inner join customers'
pd.read_sql_query(q, conn)

    FirstName            Title  FirstName            Title
0      Andrew  General Manager       Luís  General Manager
1      Andrew  General Manager     Leonie  General Manager
2      Andrew  General Manager   François  General Manager
3      Andrew  General Manager      Bjørn  General Manager
4      Andrew  General Manager  František  General Manager
..        ...              ...        ...              ...
467     Laura         IT Staff       Mark         IT Staff
468     Laura         IT Staff      Diego         IT Staff
469     Laura         IT Staff       Luis         IT Staff
470     Laura         IT Staff      Manoj         IT Staff
471     Laura         IT Staff       Puja         IT Staff

[472 rows x 4 columns]

In [ ]:
# List the first five customers order by their supporter's first name in descending order
q = 'select employees.FirstName, customers.FirstName from customers inner join employees desc limit 5'
pd.read_sql_query(q, conn)

DatabaseError: ignored

### OUTER JOINS

Depending on how you want to analyze the data, the INNER JOIN we used last lesson might not be sufficient because the resulting table only contains data that belongs in both of the tables.

If the two tables have asymmetric data, which can easily happen when data is entered in different stages, then we would have to use a LEFT JOIN, RIGHT JOIN or FULL JOIN instead to ensure that the data you need is not left out of the results.

```
SELECT column, another_column, …
FROM mytable
INNER/LEFT/RIGHT/FULL JOIN another_table 
    ON mytable.id = another_table.matching_id
WHERE condition(s)
ORDER BY column, … ASC/DESC
LIMIT num_limit OFFSET num_offset;
```

Sometimes, it's not possible to avoid **NULL** values. In these case, you can test a column for **NULL** values in a WHERE clause by using either the **IS NULL** or **IS NOT NULL** constraint.

```
SELECT column, another_column, …
FROM mytable
WHERE column IS/IS NOT NULL
AND/OR another_condition
AND/OR …;
```

In [ ]:
# Find all tracks that couldn't be sold (null invoice_items)
query1 = """ 
        SELECT tracks.TrackId, tracks.Name, invoice_items.TrackId
        FROM tracks LEFT JOIN invoice_items
        ON tracks.TrackId = invoice_items.TrackId
        WHERE invoice_items.TrackId IS NULL
        """
pd.read_sql_query(query1, conn)

     TrackId                                               Name TrackId
0          7                                    Let's Get It Up    None
1         11                                             C.O.D.    None
2         17                                  Let There Be Rock    None
3         18                                     Bad Boy Boogie    None
4         22                                  Whole Lotta Rosie    None
...      ...                                                ...     ...
1514    3497                                    Erlkonig, D.328    None
1515    3498  Concerto for Violin, Strings and Continuo in G...    None
1516    3501               L'orfeo, Act 3, Sinfonia (Orchestra)    None
1517    3502  Quintet for Horn, Violin, 2 Violas, and Cello ...    None
1518    3503                                      Koyaanisqatsi    None

[1519 rows x 3 columns]

In [ ]:
# List all genres and the distinct media types in each genre
q = '''
    SELECT DISTINCT genres.Name, media_types.Name 
    FROM genres LEFT JOIN media_types
    '''
pd.read_sql_query(q, conn)

      Name                         Name
0     Rock              MPEG audio file
1     Rock     Protected AAC audio file
2     Rock  Protected MPEG-4 video file
3     Rock     Purchased AAC audio file
4     Rock               AAC audio file
..     ...                          ...
120  Opera              MPEG audio file
121  Opera     Protected AAC audio file
122  Opera  Protected MPEG-4 video file
123  Opera     Purchased AAC audio file
124  Opera               AAC audio file

[125 rows x 2 columns]

### Queries with aggregates

SQL also supports the use of aggregate expressions (or functions) that allow you to summarize information about a group of rows of data.

Common aggregate functions:

| Functions | Description |
|:-:|:-:|
|**COUNT**(*), **COUNT**(column) | A common function used to counts the number of rows in the group if no column name is specified. Otherwise, count the number of rows in the group with non-NULL values in the specified column.|
|**MIN**(column) | Finds the smallest numerical value in the specified column for all rows in the group.|
|**MAX**(column) | Finds the largest numerical value in the specified column for all rows in the group.|
|**AVG**(column) | Finds the average numerical value in the specified column for all rows in the group.|
|**SUM**(column) | Finds the sum of all numerical values in the specified column for the rows in the group.|

More docs: [SQLite](http://www.sqlite.org/lang_aggfunc.html), [MySQL](https://dev.mysql.com/doc/refman/5.6/en/group-by-functions.html), [Postgres](http://www.postgresql.org/docs/9.4/static/functions-aggregate.html)

In addition to aggregating across all the rows, you can instead apply the aggregate functions to individual groups of data within that group. This would then create as many results as there are unique groups defined as by the  **GROUP BY** clause.

```
SELECT AGG_FUNC(column_or_expression) AS aggregate_description, …
FROM mytable
WHERE constraint_expression
GROUP BY column;
```

Our queries are getting fairly complex, but we have nearly introduced all the important parts of a  **SELECT** query. One thing that you might have noticed is that if the **GROUP BY** clause is executed after the **WHERE** clause (which filters the rows which are to be grouped), then how exactly do we filter the grouped rows?

Luckily, SQL allows us to do this by adding an additional **HAVING** clause which is used specifically with the **GROUP BY** clause to allow us to filter grouped rows from the result set.

```
SELECT group_by_column, AGG_FUNC(column_expression) AS aggregate_result_alias, …
FROM mytable
WHERE condition
GROUP BY column
HAVING group_condition;
```

In [ ]:
# Find the revenue of 2013
pd.read_sql_query('''___''', conn)

In [ ]:
# Find the number of tracks belong to the genre Rock
pd.read_sql_query('''___''', conn)

In [ ]:
# Find the number of customers each employee has supported
pd.read_sql_query('''___''', conn)

In [ ]:
# Find the customer who paid the most
pd.read_sql_query('''___ ''', conn)

In [ ]:
# Find the richest artist
pd.read_sql_query('''___''', conn)

### Query order of execution

Now that we have an idea of all the parts of a query, we can now talk about how they all fit together in the context of a complete query.

1. **FROM** and **JOIN**
2. **WHERE**
3. **GROUP BY**
4. **HAVING**
5. **SELECT**
6. **DISTINCT**
7. **ORDER BY**
8. **LIMIT** / **OFFSET**

### Conclusion

Not every query needs to have all the parts we listed above, but a part of why SQL is so flexible is that it allows developers and data analysts to quickly manipulate data without having to write additional code, all just by using the above clauses.

Here ends our lessons on **SELECT** queries, congrats of making it this far!